# 100 pandas puzzles

Inspired by [100 Numpy exerises](https://github.com/rougier/numpy-100), here are 100* short puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power.

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating, cleaning), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy... don't go using pure Python or Cython!). Choosing the right methods and following best practices is the underlying goal.

The exercises are loosely divided in sections. Each section has a difficulty rating; these ratings are subjective, of course, but should be a seen as a rough guide as to how inventive the required solution is.

If you're just starting out with pandas and you are looking for some other resources, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy the puzzles!

\* *the list of exercises is not yet complete! Pull requests or suggestions for additional exercises, corrections and improvements are welcomed.*

## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import pandas under the alias `pd`.

In [1]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [2]:
pd.__version__

'2.2.3'

**3.** Print out all the *version* information of the libraries that are required by the pandas library.

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [59]:
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data=data,index=labels)

**5.** Display a summary of the basic information about this DataFrame and its data (*hint: there is a single method that can be called on the DataFrame*).

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**6.** Return the first 3 rows of the DataFrame `df`.

In [57]:
df.head(3)

   A
0  1
1  2
2  2

**7.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [60]:
df[["animal","age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [11]:
df[["animal","age"]].iloc[[3,4,8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**9.** Select only the rows where the number of visits is greater than 3.

In [14]:
df[df["visits"]>1]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
i    dog  7.0       2       no

**10.** Select the rows where the age is missing, i.e. it is `NaN`.

In [16]:
df[df.age.isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**11.** Select the rows where the animal is a cat *and* the age is less than 3.

In [61]:
df[(df["animal"] == "cat")&(df["age"]<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

:

**12.** Select the rows the age is between 2 and 4 (inclusive).

In [18]:
df[(df["age"] >=2)&(df["age"]<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

**13.** Change the age in row 'f' to 1.5.

In [22]:
df.loc["f","age"] = 1.5

**14.** Calculate the sum of all visits in `df` (i.e. find the total number of visits).

In [25]:
df.sum()["visits"]

np.int64(19)

**15.** Calculate the mean age for each different animal in `df`.

In [29]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [35]:
df.loc['k'] = ['monkey',1,2,"yes"]
df.drop('k', inplace=True)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**17.** Count the number of each type of animal in `df`.

In [41]:
df['animal'].value_counts()

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visits' column in *ascending* order (so row `i` should be first, and row `d` should be last).

In [43]:
df.sort_values(by=['age','visits'], ascending=[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

**19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [48]:
df = df.replace({'yes':True,'no':False})
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  1.5       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

**20.** In the 'animal' column, change the 'snake' entries to 'python'.

In [51]:
df
df = df.replace({"snake":"python"})
df

   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  1.5       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (*hint: use a pivot table*).

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

```python
1, 2, 3, 4, 5, 6, 7
```

In [55]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

df.loc[df['A'].shift() != df['A']]
df.drop_duplicates(subset='A')
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

**23.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

**24.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum?  Return that column's label.

**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? As input, use a DataFrame of zeros and ones with 10 rows and 3 columns.

```python
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
```

The next three puzzles are slightly harder.


**26.** In the cell below, you have a DataFrame `df` that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values. 

For each row of the DataFrame, find the *column* which contains the *third* NaN value.

You should return a Series of column labels: `e, c, d, h, d`

In [ ]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)

# write a solution to the question here

**27.** A DataFrame has a column of groups 'grps' and and column of integer values 'vals': 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values. You should end up with the answer as follows:
```
grps
a    409
b    156
c    345
```

In [ ]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'),
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

# write a solution to the question here

**28.** The DataFrame `df` constructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). 

For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

The answer should be a Series as follows:

```
A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
```

In [ ]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, size=(100, 2)), columns = ["A", "B"])

# write a solution to the question here

## DataFrames: harder problems 

### These might require a bit of thinking outside the box...

...but all are solvable using just the usual pandas/NumPy methods (and so avoid using explicit `for` loops).

Difficulty: *hard*

**29.** Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be 

```
[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]
```

Make this a new column 'Y'.

**30.** Consider the DataFrame constructed below which contains rows and columns of numerical data. 

Create a list of the column-row index locations of the 3 largest values in this DataFrame. In this case, the answer should be:
```
[(5, 7), (6, 4), (2, 5)]
```

In [ ]:
df = pd.DataFrame(np.random.RandomState(30).randint(1, 101, size=(8, 8)))

**31.** You are given the DataFrame below with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals'.

```python
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
```

Create a new column 'patched_values' which contains the same values as the 'vals' any negative values in 'vals' with the group mean:

```
    vals grps  patched_vals
0    -12    A          13.6
1     -7    B          28.0
2    -14    A          13.6
3      4    A           4.0
4     -7    A          13.6
5     28    B          28.0
6     -2    A          13.6
7     -1    A          13.6
8      8    A           8.0
9     -2    B          28.0
10    28    A          28.0
11    12    A          12.0
12    16    A          16.0
13   -24    A          13.6
14   -12    A          13.6
```

**32.** Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
The goal is to compute the Series:

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at row index 5. Instead of being NaN the value in the new column at this row index should be 3.0 (just the two non-NaN values are used to compute the mean (3+3)/2)

## Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data

Difficulty: *easy/medium*

pandas is fantastic for working with dates and times. These puzzles explore some of this functionality.

**33.** Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series `s`.

**34.** Find the sum of the values in `s` for every Wednesday.

**35.** For each calendar month in `s`, find the mean of values.

**36.** For each group of four consecutive calendar months in `s`, find the date on which the highest value occurred.

**37.** Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

## Cleaning Data

### Making a DataFrame easier to work with

Difficulty: *easy/medium*

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```
Formatted, it looks like this:

```
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
```


(It's some flight data I made up; it's not meant to be accurate in any way.)

**38.** Some values in the the **FlightNumber** column are missing (they are `NaN`). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify `df` to fill in these missing numbers and make the column an integer column (instead of a float column).

**39.** The **From\_To** column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame called 'temp' with the correct values. Assign the correct column names 'From' and 'To' to this temporary DataFrame.

**40.** Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

**41.** Delete the **From_To** column from `df` and attach the temporary DataFrame 'temp' from the previous questions.

**42**. In the **Airline** column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

**43**. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc. and replace the unwanted RecentDelays column in `df` with `delays`.

The DataFrame should look much better now.
```
   FlightNumber          Airline      From         To  delay_1  delay_2  delay_3
0         10045              KLM    London      Paris     23.0     47.0      NaN
1         10055       Air France    Madrid      Milan      NaN      NaN      NaN
2         10065  British Airways    London  Stockholm     24.0     43.0     87.0
3         10075       Air France  Budapest      Paris     13.0      NaN      NaN
4         10085        Swiss Air  Brussels     London     67.0     32.0      NaN
```

## Using MultiIndexes

### Go beyond flat DataFrames with additional index levels

Difficulty: *medium*

Previous exercises have seen us analysing data from DataFrames equipped with a single index level. However, pandas also gives you the possibilty of indexing your data using *multiple* levels. This is very much like adding new dimensions to a Series or a DataFrame. For example, a Series is 1D, but by using a MultiIndex with 2 levels we gain of much the same functionality as a 2D DataFrame.

The set of puzzles below explores how you might use multiple index levels to enhance data analysis.

To warm up, we'll look make a Series with two index levels.

**44**. Given the lists `letters = ['A', 'B', 'C']` and `numbers = list(range(10))`, construct a MultiIndex object from the product of the two lists. Use it to index a Series of random numbers. Call this Series `s`.

**45.** Check the index of `s` is lexicographically sorted (this is a necessary proprty for indexing to work correctly with a MultiIndex).

**46**. Select the labels `1`, `3` and `6` from the second level of the MultiIndexed Series.

**47**. Slice the Series `s`; slice up to label 'B' for the first level and from label 5 onwards for the second level.

**48**. Sum the values in `s` for each label in the first level (you should have Series giving you a total for labels A, B and C).

**49**. Suppose that `sum()` (and other methods) did not accept a `level` keyword argument. How else could you perform the equivalent of `s.sum(level=1)`?

**50**. Exchange the levels of the MultiIndex so we have an index of the form (letters, numbers). Is this new Series properly lexsorted? If not, sort it.

## Minesweeper

### Generate the numbers for safe squares in a Minesweeper grid

Difficulty: *medium* to *hard*

If you've ever used an older version of Windows, there's a good chance you've played with Minesweeper:
- https://en.wikipedia.org/wiki/Minesweeper_(video_game)


If you're not familiar with the game, imagine a grid of squares: some of these squares conceal a mine. If you click on a mine, you lose instantly. If you click on a safe square, you reveal a number telling you how many mines are found in the squares that are immediately adjacent. The aim of the game is to uncover all squares in the grid that do not contain a mine.

In this section, we'll make a DataFrame that contains the necessary data for a game of Minesweeper: coordinates of the squares, whether the square contains a mine and the number of mines found on adjacent squares.

**51**. Let's suppose we're playing Minesweeper on a 5 by 4 grid, i.e.
```
X = 5
Y = 4
```
To begin, generate a DataFrame `df` with two columns, `'x'` and `'y'` containing every coordinate for this grid. That is, the DataFrame should start:
```
   x  y
0  0  0
1  0  1
2  0  2
```

**52**. For this DataFrame `df`, create a new column of zeros (safe) and ones (mine). The probability of a mine occuring at each location should be 0.4.

**53**. Now create a new column for this DataFrame called `'adjacent'`. This column should contain the number of mines found on adjacent squares in the grid. 

(E.g. for the first row, which is the entry for the coordinate `(0, 0)`, count how many mines are found on the coordinates `(0, 1)`, `(1, 0)` and `(1, 1)`.)

**54**. For rows of the DataFrame that contain a mine, set the value in the `'adjacent'` column to NaN.

**55**. Finally, convert the DataFrame to grid of the adjacent mine counts: columns are the `x` coordinate, rows are the `y` coordinate.

## Plotting

### Visualize trends and patterns in data

Difficulty: *medium*

To really get a good understanding of the data contained in your DataFrame, it is often essential to create plots: if you're lucky, trends and anomalies will jump right out at you. This functionality is baked into pandas and the puzzles below explore some of what's possible with the library.

**56.** Pandas is highly integrated with the plotting library matplotlib, and makes plotting DataFrames very user-friendly! Plotting in a notebook environment usually makes use of the following boilerplate:

```python
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')
```

matplotlib is the plotting library which pandas' plotting functionality is built upon, and it is usually aliased to ```plt```.

```%matplotlib inline``` tells the notebook to show plots inline, instead of creating them in a separate window.  

```plt.style.use('ggplot')``` is a style theme that most people find agreeable, based upon the styling of R's ggplot package.

For starters, make a scatter plot of this random data, but use black X's instead of the default markers. 

```df = pd.DataFrame({"xs":[1,5,2,8,1], "ys":[4,2,1,9,6]})```

Consult the [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html) if you get stuck!

**57.** Columns in your DataFrame can also be used to modify colors and sizes.  Bill has been keeping track of his performance at work over time, as well as how good he was feeling that day, and whether he had a cup of coffee in the morning.  Make a plot which incorporates all four features of this DataFrame.

(Hint:  If you're having trouble seeing the plot, try multiplying the Series which you choose to represent size by 10 or more)

*The chart doesn't have to be pretty: this isn't a course in data viz!*

```
df = pd.DataFrame({"productivity":[5,2,3,1,4,5,6,7,8,3,4,8,9],
                   "hours_in"    :[1,9,6,5,3,9,2,9,1,7,4,2,2],
                   "happiness"   :[2,1,3,2,3,1,2,3,1,2,2,1,3],
                   "caffienated" :[0,0,1,1,0,0,0,0,1,1,0,1,0]})
```

**58.**  What if we want to plot multiple things?  Pandas allows you to pass in a matplotlib *Axis* object for plots, and plots will also return an Axis object.

Make a bar plot of monthly revenue with a line plot of monthly advertising spending (numbers in millions)

```
df = pd.DataFrame({"revenue":[57,68,63,71,72,90,80,62,59,51,47,52],
                   "advertising":[2.1,1.9,2.7,3.0,3.6,3.2,2.7,2.4,1.8,1.6,1.3,1.9],
                   "month":range(12)
                  })
```

Now we're finally ready to create a candlestick chart, which is a very common tool used to analyze stock price data.  A candlestick chart shows the opening, closing, highest, and lowest price for a stock during a time window.  The color of the "candle" (the thick part of the bar) is green if the stock closed above its opening price, or red if below.

![Candlestick Example](img/candle.jpg)

This was initially designed to be a pandas plotting challenge, but it just so happens that this type of plot is just not feasible using pandas' methods.  If you are unfamiliar with matplotlib, we have provided a function that will plot the chart for you so long as you can use pandas to get the data into the correct format.

Your first step should be to get the data in the correct format using pandas' time-series grouping function.  We would like each candle to represent an hour's worth of data.  You can write your own aggregation function which returns the open/high/low/close, but pandas has a built-in which also does this.

The below cell contains helper functions.  Call ```day_stock_data()``` to generate a DataFrame containing the prices a hypothetical stock sold for, and the time the sale occurred.  Call ```plot_candlestick(df)``` on your properly aggregated and formatted stock data to print the candlestick chart.

In [1]:
import numpy as np
def float_to_time(x):
    return str(int(x)) + ":" + str(int(x%1 * 60)).zfill(2) + ":" + str(int(x*60 % 1 * 60)).zfill(2)

def day_stock_data():
    #NYSE is open from 9:30 to 4:00
    time = 9.5
    price = 100
    results = [(float_to_time(time), price)]
    while time < 16:
        elapsed = np.random.exponential(.001)
        time += elapsed
        if time > 16:
            break
        price_diff = np.random.uniform(.999, 1.001)
        price *= price_diff
        results.append((float_to_time(time), price))


    df = pd.DataFrame(results, columns = ['time','price'])
    df.time = pd.to_datetime(df.time)
    return df

#Don't read me unless you get stuck!
def plot_candlestick(agg):
    """
    agg is a DataFrame which has a DatetimeIndex and five columns: ["open","high","low","close","color"]
    """
    fig, ax = plt.subplots()
    for time in agg.index:
        ax.plot([time.hour] * 2, agg.loc[time, ["high","low"]].values, color = "black")
        ax.plot([time.hour] * 2, agg.loc[time, ["open","close"]].values, color = agg.loc[time, "color"], linewidth = 10)

    ax.set_xlim((8,16))
    ax.set_ylabel("Price")
    ax.set_xlabel("Hour")
    ax.set_title("OHLC of Stock Value During Trading Day")
    plt.show()

**59.** Generate a day's worth of random stock data, and aggregate / reformat it so that it has hourly summaries of the opening, highest, lowest, and closing prices

**60.** Now that you have your properly-formatted data, try to plot it yourself as a candlestick chart.  Use the ```plot_candlestick(df)``` function above, or matplotlib's [```plot``` documentation](https://matplotlib.org/api/_as_gen/matplotlib.axes.Axes.plot.html) if you get stuck.

*More exercises to follow soon...*

In [1]:
col_names = ["order_id", "order_date", "order_customer_id", "order_status"]

In [3]:
import pandas as pd

orders = pd.read_csv(r"C:\Users\abnages\Downloads\orders.csv",
            header=None, names=col_names)

In [5]:
orders['order_status'].unique()

array(['CLOSED', 'PENDING_PAYMENT', 'COMPLETE', 'PROCESSING',
       'PAYMENT_REVIEW', 'PENDING', 'ON_HOLD', 'CANCELED',
       'SUSPECTED_FRAUD'], dtype=object)

In [18]:
orders[(orders["order_status"] == 'ON_HOLD') | (orders["order_date"] == "2014-01-01 00:00:00.0")]

       order_id             order_date  order_customer_id order_status
45           46  2013-07-25 00:00:00.0               1549      ON_HOLD
65           66  2013-07-25 00:00:00.0               1792      ON_HOLD
88           89  2013-07-25 00:00:00.0                824      ON_HOLD
144         145  2013-07-26 00:00:00.0                494      ON_HOLD
150         151  2013-07-26 00:00:00.0               2493      ON_HOLD
...         ...                    ...                ...          ...
68853     68854  2014-06-01 00:00:00.0               6528      ON_HOLD
68863     68864  2014-06-18 00:00:00.0               9634      ON_HOLD
68874     68875  2014-07-04 00:00:00.0              10637      ON_HOLD
68876     68877  2014-07-07 00:00:00.0               9692      ON_HOLD
68881     68882  2014-07-22 00:00:00.0              10000      ON_HOLD

[3928 rows x 4 columns]

In [20]:
orders.groupby('order_status')['order_id'].agg("count")

order_status
CANCELED            1428
CLOSED              7556
COMPLETE           22899
ON_HOLD             3798
PAYMENT_REVIEW       729
PENDING             7610
PENDING_PAYMENT    15030
PROCESSING          8275
SUSPECTED_FRAUD     1558
Name: order_id, dtype: int64

In [21]:
orders.groupby('order_status').size()

order_status
CANCELED            1428
CLOSED              7556
COMPLETE           22899
ON_HOLD             3798
PAYMENT_REVIEW       729
PENDING             7610
PENDING_PAYMENT    15030
PROCESSING          8275
SUSPECTED_FRAUD     1558
dtype: int64

In [22]:
orders["order_month"] = orders.apply(lambda order:order.order_date[:7], axis = 1)

In [23]:
orders.groupby(['order_month','order_status'])['order_id'].agg(order_count='count')

                             order_count
order_month order_status
2013-07     CANCELED                  22
            CLOSED                   161
            COMPLETE                 515
            ON_HOLD                   81
            PAYMENT_REVIEW            19
...                                  ...
2014-07     PAYMENT_REVIEW            54
            PENDING                  517
            PENDING_PAYMENT          979
            PROCESSING               561
            SUSPECTED_FRAUD          101

[117 rows x 1 columns]

In [28]:
orders['month'] = pd.to_datetime(orders['order_date']).dt.to_period("M")
orders.groupby(['order_month', 'order_status'])['order_id'].count().rename("order_count").reset_index()
orders

,order_id,order_date,order_customer_id,order_status,order_month,month
0,1,2013-07-25 00:00:00.0,11599,CLOSED,2013-07,2013-07
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,2013-07,2013-07
2,3,2013-07-25 00:00:00.0,12111,COMPLETE,2013-07,2013-07
3,4,2013-07-25 00:00:00.0,8827,CLOSED,2013-07,2013-07
4,5,2013-07-25 00:00:00.0,11318,COMPLETE,2013-07,2013-07
...,...,...,...,...,...,...
68878,68879,2014-07-09 00:00:00.0,778,COMPLETE,2014-07,2014-07
68879,68880,2014-07-13 00:00:00.0,1117,COMPLETE,2014-07,2014-07
68880,68881,2014-07-19 00:00:00.0,2518,PENDING_PAYMENT,2014-07,2014-07
68881,68882,2014-07-22 00:00:00.0,10000,ON_HOLD,2014-07,2014-07
68882,68883,2014-07-23 00:00:00.0,5533,COMPLETE,2014-07,2014-07

In [32]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.38-cp311-cp311-win_amd64.whl.metadata (9.9 kB)
Collecting greenlet!=0.4.17 (from sqlalchemy)
  Downloading greenlet-3.1.1-cp311-cp311-win_amd64.whl.metadata (3.9 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy)
  Downloading typing_extensions-4.12.2-py3-none-any.whl.metadata (3.0 kB)
Downloading SQLAlchemy-2.0.38-cp311-cp311-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   --------- ------------------------------ 0.5/2.1 MB 1.7 MB/s eta 0:00:01
   -------------- ------------------------- 0.8/2.1 MB 1.8 MB/s eta 0:00:01
   ----------------------------- ---------- 1.6/2.1 MB 2.5 MB/s eta 0:00:01
   ---------------------------------- ----- 1.8/2.1 MB 2.6 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 2.1 MB/s eta 0:00:00
Downloading greenlet-3.1.1-cp311-cp311-win_amd64.whl (298 kB)
Downloading typing_extensions-4.12.2-py3-none-any.whl (37 kB)
Installing collected packages: typing-extensions, greenlet, sqlalchemy
Successfully installed greenlet-3.1.1 sqlalchemy-2.0.38 typing-extensions-4.12.2

WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)

In [1]:
!pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.5.tar.gz (317.2 MB)
     ---------------------------------------- 0.0/317.2 MB ? eta -:--:--
     ---------------------------------------- 0.3/317.2 MB ? eta -:--:--
     ---------------------------------------- 0.8/317.2 MB 2.4 MB/s eta 0:02:13
     ---------------------------------------- 1.0/317.2 MB 3.0 MB/s eta 0:01:47
     ---------------------------------------- 1.6/317.2 MB 2.6 MB/s eta 0:02:01
     ---------------------------------------- 2.6/317.2 MB 2.8 MB/s eta 0:01:53
     ---------------------------------------- 3.7/317.2 MB 3.2 MB/s eta 0:01:38
      --------------------------------------- 5.0/317.2 MB 3.7 MB/s eta 0:01:25
      --------------------------------------- 7.3/317.2 MB 4.8 MB/s eta 0:01:06
     - ------------------------------------- 10.2/317.2 MB 5.9 MB/s eta 0:00:53
     - ------------------------------------- 13.9/317.2 MB 7.1 MB/s eta 0:00:43
     -- ------------------------------------ 17.8/317.2 MB 8.3 MB/s eta 0:00:37
     -- ------------------------------------ 22.0/317.2 MB 9.3 MB/s eta 0:00:32
     --- ----------------------------------- 25.4/317.2 MB 9.9 MB/s eta 0:00:30
     --- ---------------------------------- 28.8/317.2 MB 10.3 MB/s eta 0:00:28
     --- ---------------------------------- 32.2/317.2 MB 10.8 MB/s eta 0:00:27
     ---- --------------------------------- 36.4/317.2 MB 11.3 MB/s eta 0:00:25
     ---- --------------------------------- 41.2/317.2 MB 12.0 MB/s eta 0:00:23
     ----- -------------------------------- 45.4/317.2 MB 12.5 MB/s eta 0:00:22
     ----- -------------------------------- 49.5/317.2 MB 12.9 MB/s eta 0:00:21
     ------ ------------------------------- 53.5/317.2 MB 13.1 MB/s eta 0:00:21
     ------ ------------------------------- 57.7/317.2 MB 13.5 MB/s eta 0:00:20
     ------- ------------------------------ 61.3/317.2 MB 13.7 MB/s eta 0:00:19
     ------- ------------------------------ 65.0/317.2 MB 13.8 MB/s eta 0:00:19
     -------- ----------------------------- 69.2/317.2 MB 14.1 MB/s eta 0:00:18
     -------- ----------------------------- 73.7/317.2 MB 14.3 MB/s eta 0:00:18
     --------- ---------------------------- 78.1/317.2 MB 14.6 MB/s eta 0:00:17
     --------- ---------------------------- 82.6/317.2 MB 14.8 MB/s eta 0:00:16
     ---------- --------------------------- 84.7/317.2 MB 14.9 MB/s eta 0:00:16
     ---------- --------------------------- 84.7/317.2 MB 14.9 MB/s eta 0:00:16
     ---------- --------------------------- 84.9/317.2 MB 13.6 MB/s eta 0:00:18
     ---------- --------------------------- 88.6/317.2 MB 13.8 MB/s eta 0:00:17
     ----------- -------------------------- 92.8/317.2 MB 14.0 MB/s eta 0:00:17
     ----------- -------------------------- 97.0/317.2 MB 14.2 MB/s eta 0:00:16
     ----------- ------------------------- 101.2/317.2 MB 14.3 MB/s eta 0:00:16
     ------------ ------------------------ 105.9/317.2 MB 14.5 MB/s eta 0:00:15
     ------------ ------------------------ 109.1/317.2 MB 14.7 MB/s eta 0:00:15
     ------------- ----------------------- 113.5/317.2 MB 14.7 MB/s eta 0:00:14
     ------------- ----------------------- 118.0/317.2 MB 14.9 MB/s eta 0:00:14
     -------------- ---------------------- 122.7/317.2 MB 15.1 MB/s eta 0:00:13
     -------------- ---------------------- 127.1/317.2 MB 15.2 MB/s eta 0:00:13
     --------------- --------------------- 131.9/317.2 MB 15.4 MB/s eta 0:00:13
     --------------- --------------------- 136.3/317.2 MB 15.5 MB/s eta 0:00:12
     ---------------- -------------------- 140.5/317.2 MB 15.6 MB/s eta 0:00:12
     ---------------- -------------------- 144.7/317.2 MB 15.7 MB/s eta 0:00:11
     ----------------- ------------------- 148.9/317.2 MB 15.8 MB/s eta 0:00:11
     ----------------- ------------------- 152.6/317.2 MB 15.8 MB/s eta 0:00:11
     ------------------ ------------------ 156.5/317.2 MB 15.9 MB/s eta 0:00:11
     ------------------ ------------------ 160.4/317.2 MB 15.9 MB/s eta 0:00:10
     ------------------- ----------------- 164.4/317.2 MB 16.0 MB/s eta 0:00:10
     ------------------- ----------------- 168.3/317.2 MB 16.0 MB/s eta 0:00:10
     -------------------- ---------------- 172.8/317.2 MB 16.1 MB/s eta 0:00:09
     -------------------- ---------------- 176.7/317.2 MB 16.2 MB/s eta 0:00:09
     --------------------- --------------- 180.9/317.2 MB 16.2 MB/s eta 0:00:09
     --------------------- --------------- 184.5/317.2 MB 16.3 MB/s eta 0:00:09
     ---------------------- -------------- 189.3/317.2 MB 16.4 MB/s eta 0:00:08
     ---------------------- -------------- 194.2/317.2 MB 16.5 MB/s eta 0:00:08
     ----------------------- ------------- 197.4/317.2 MB 16.4 MB/s eta 0:00:08
     ----------------------- ------------- 201.1/317.2 MB 16.5 MB/s eta 0:00:08
     ------------------------ ------------ 205.8/317.2 MB 16.5 MB/s eta 0:00:07
     ------------------------ ------------ 210.0/317.2 MB 16.6 MB/s eta 0:00:07
     ------------------------- ----------- 214.7/317.2 MB 16.7 MB/s eta 0:00:07
     ------------------------- ----------- 219.4/317.2 MB 16.8 MB/s eta 0:00:06
     -------------------------- ---------- 223.6/317.2 MB 16.8 MB/s eta 0:00:06
     -------------------------- ---------- 227.8/317.2 MB 16.9 MB/s eta 0:00:06
     --------------------------- --------- 231.7/317.2 MB 16.9 MB/s eta 0:00:06
     --------------------------- --------- 235.4/317.2 MB 16.9 MB/s eta 0:00:05
     --------------------------- --------- 239.3/317.2 MB 16.9 MB/s eta 0:00:05
     ---------------------------- -------- 242.7/317.2 MB 16.9 MB/s eta 0:00:05
     ---------------------------- -------- 246.7/317.2 MB 16.9 MB/s eta 0:00:05
     ----------------------------- ------- 250.9/317.2 MB 17.0 MB/s eta 0:00:04
     ----------------------------- ------- 255.1/317.2 MB 17.0 MB/s eta 0:00:04
     ------------------------------ ------ 259.0/317.2 MB 17.0 MB/s eta 0:00:04
     ------------------------------ ------ 263.2/317.2 MB 17.5 MB/s eta 0:00:04
     ------------------------------- ----- 267.6/317.2 MB 18.4 MB/s eta 0:00:03
     ------------------------------- ----- 271.6/317.2 MB 18.5 MB/s eta 0:00:03
     -------------------------------- ---- 275.3/317.2 MB 18.5 MB/s eta 0:00:03
     -------------------------------- ---- 278.9/317.2 MB 18.4 MB/s eta 0:00:03
     -------------------------------- ---- 282.6/317.2 MB 18.4 MB/s eta 0:00:02
     --------------------------------- --- 286.5/317.2 MB 18.5 MB/s eta 0:00:02
     --------------------------------- --- 290.5/317.2 MB 18.5 MB/s eta 0:00:02
     ---------------------------------- -- 295.2/317.2 MB 18.6 MB/s eta 0:00:02
     ---------------------------------- -- 299.1/317.2 MB 18.6 MB/s eta 0:00:01
     ----------------------------------- - 303.0/317.2 MB 18.5 MB/s eta 0:00:01
     ----------------------------------- - 307.5/317.2 MB 18.5 MB/s eta 0:00:01
     ------------------------------------  310.6/317.2 MB 18.5 MB/s eta 0:00:01
     ------------------------------------  314.6/317.2 MB 18.5 MB/s eta 0:00:01
     ------------------------------------  317.2/317.2 MB 18.5 MB/s eta 0:00:01
     ------------------------------------  317.2/317.2 MB 18.5 MB/s eta 0:00:01
     ------------------------------------  317.2/317.2 MB 18.5 MB/s eta 0:00:01
     ------------------------------------  317.2/317.2 MB 18.5 MB/s eta 0:00:01
     ------------------------------------- 317.2/317.2 MB 17.4 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Collecting py4j==0.10.9.7 (from pyspark)
  Downloading py4j-0.10.9.7-py2.py3-none-any.whl.metadata (1.5 kB)
Downloading py4j-0.10.9.7-py2.py3-none-any.whl (200 kB)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py): started
  Building wheel for pyspark (setup.py): finished with status 'done'
  Created wheel for pyspark: filename=pyspark-3.5.5-py2.py3-none-any.whl size=317747901 sha256=7c1580aa00d9039dc4d2c8e19556d61c17dfe06430b3924a75cb810401aad75b
  Stored in directory: c:\users\abnages\appdata\local\pip\cache\wheels\0c\7f\b4\0e68c6d8d89d2e582e5498ad88616c16d7c19028680e9d3840
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.7 pyspark-3.5.5

WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)
WARNING: Ignoring invalid distribution ~ywin32 (C:\Users\abnages\AppData\Roaming\Python\Python311\site-packages)

In [3]:
import pyspark

In [4]:
import pandas as pd
pd.read_csv(r"C:\Users\abnages\Downloads\orders.csv")

           1  2013-07-25 00:00:00.0  11599           CLOSED
0          2  2013-07-25 00:00:00.0    256  PENDING_PAYMENT
1          3  2013-07-25 00:00:00.0  12111         COMPLETE
2          4  2013-07-25 00:00:00.0   8827           CLOSED
3          5  2013-07-25 00:00:00.0  11318         COMPLETE
4          6  2013-07-25 00:00:00.0   7130         COMPLETE
...      ...                    ...    ...              ...
68877  68879  2014-07-09 00:00:00.0    778         COMPLETE
68878  68880  2014-07-13 00:00:00.0   1117         COMPLETE
68879  68881  2014-07-19 00:00:00.0   2518  PENDING_PAYMENT
68880  68882  2014-07-22 00:00:00.0  10000          ON_HOLD
68881  68883  2014-07-23 00:00:00.0   5533         COMPLETE

[68882 rows x 4 columns]

In [5]:
from pyspark.sql import SparkSession

In [6]:
spark = SparkSession.builder.appName("example").getOrCreate()

In [7]:
spark

In [49]:
df_spark = spark.read.csv(r"C:\Users\abnages\Downloads\coffee.csv", header = True, inferSchema=True)
df_spark.show(5)

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|      NULL|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|      NULL|
|Wednesday|   Espresso|        35|
+---------+-----------+----------+
only showing top 5 rows

In [50]:
type(df_spark)

pyspark.sql.dataframe.DataFrame

In [27]:
df_spark.show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|        15|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|        20|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [28]:
df_spark.select(['Day', 'Coffee Type']).show()

+---------+-----------+
|      Day|Coffee Type|
+---------+-----------+
|   Monday|   Espresso|
|   Monday|      Latte|
|  Tuesday|   Espresso|
|  Tuesday|      Latte|
|Wednesday|   Espresso|
|Wednesday|      Latte|
| Thursday|   Espresso|
| Thursday|      Latte|
|   Friday|   Espresso|
|   Friday|      Latte|
| Saturday|   Espresso|
| Saturday|      Latte|
|   Sunday|   Espresso|
|   Sunday|      Latte|
+---------+-----------+

In [ ]:
df_spark.dtypes

[('Day', 'string'), ('Coffee Type', 'string'), ('Units Sold', 'int')]

In [42]:
df_spark = df_spark.withColumn("units sold after" , df_spark['Units Sold']+1)

In [43]:
df_spark.show()

+---------+-----------+----------+----------------+
|      Day|Coffee Type|Units Sold|units sold after|
+---------+-----------+----------+----------------+
|   Monday|   Espresso|        25|              26|
|   Monday|      Latte|        15|              16|
|  Tuesday|   Espresso|        30|              31|
|  Tuesday|      Latte|        20|              21|
|Wednesday|   Espresso|        35|              36|
|Wednesday|      Latte|        25|              26|
| Thursday|   Espresso|        40|              41|
| Thursday|      Latte|        30|              31|
|   Friday|   Espresso|        45|              46|
|   Friday|      Latte|        35|              36|
| Saturday|   Espresso|        45|              46|
| Saturday|      Latte|        35|              36|
|   Sunday|   Espresso|        45|              46|
|   Sunday|      Latte|        35|              36|
+---------+-----------+----------+----------------+

In [44]:
df_spark = df_spark.drop('units sold after')

In [45]:
df_spark.show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|        15|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|        20|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [47]:
df_spark = df_spark.withColumnRenamed('Day','Day of the Week')

In [48]:
df_spark.show()

+---------------+-----------+----------+
|Day of the Week|Coffee Type|Units Sold|
+---------------+-----------+----------+
|         Monday|   Espresso|        25|
|         Monday|      Latte|        15|
|        Tuesday|   Espresso|        30|
|        Tuesday|      Latte|        20|
|      Wednesday|   Espresso|        35|
|      Wednesday|      Latte|        25|
|       Thursday|   Espresso|        40|
|       Thursday|      Latte|        30|
|         Friday|   Espresso|        45|
|         Friday|      Latte|        35|
|       Saturday|   Espresso|        45|
|       Saturday|      Latte|        35|
|         Sunday|   Espresso|        45|
|         Sunday|      Latte|        35|
+---------------+-----------+----------+

In [51]:
df_spark.show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|      NULL|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|      NULL|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [52]:
df_spark.na.drop().show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|  Tuesday|   Espresso|        30|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [53]:
df_spark.show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|      NULL|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|      NULL|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [54]:
# REPLACE NULL VALUES WITH A SPECIFIC VALUE
df_spark.na.fill('FILL VALUE').show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|      NULL|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|      NULL|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [ ]:
# replace this NUll with 5 - Monday|      Latte|      NULL
df_spark = df_spark.na.fill('5 - Monday')

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|      NULL|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|      NULL|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [56]:
df_spark.show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|      NULL|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|      NULL|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [60]:
# relace NULL with specific value in a specific column uisg mean
df_spark = df_spark.na.fill(df_spark.select('Units Sold').agg({'Units Sold':'mean'}).collect()[0][0],['Units Sold'])

In [61]:
df_spark.show()

+---------+-----------+----------+
|      Day|Coffee Type|Units Sold|
+---------+-----------+----------+
|   Monday|   Espresso|        25|
|   Monday|      Latte|        35|
|  Tuesday|   Espresso|        30|
|  Tuesday|      Latte|        35|
|Wednesday|   Espresso|        35|
|Wednesday|      Latte|        25|
| Thursday|   Espresso|        40|
| Thursday|      Latte|        30|
|   Friday|   Espresso|        45|
|   Friday|      Latte|        35|
| Saturday|   Espresso|        45|
| Saturday|      Latte|        35|
|   Sunday|   Espresso|        45|
|   Sunday|      Latte|        35|
+---------+-----------+----------+

In [65]:
df_spark.filter(df_spark['Units Sold'] > 40).select('Day').show()

+--------+
|     Day|
+--------+
|  Friday|
|Saturday|
|  Sunday|
+--------+

In [67]:
df_spark.groupBy('Day').sum().show()

+---------+---------------+
|      Day|sum(Units Sold)|
+---------+---------------+
|Wednesday|             60|
|  Tuesday|             65|
|   Friday|             80|
| Thursday|             70|
| Saturday|             80|
|   Monday|             60|
|   Sunday|             80|
+---------+---------------+

In [68]:
df_spark.groupBy("Day").mean().show()

+---------+---------------+
|      Day|avg(Units Sold)|
+---------+---------------+
|Wednesday|           30.0|
|  Tuesday|           32.5|
|   Friday|           40.0|
| Thursday|           35.0|
| Saturday|           40.0|
|   Monday|           30.0|
|   Sunday|           40.0|
+---------+---------------+

**Dataengg Udemy course**

In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect("myTable.db")
connection